package taskHome;

public class Task1 {
    // 1. Найти сумму элементов массива.
    int[] array1 = {1, 2, 3, 4};

    // 2. Найти минимальный элемент массива.
    int[] array2 = {4, 2, -1, 7};


    //    // 3. Найти максимальный элемент массива.
    int[] array3 = {4, 2, -1, 7};


    //    // 4. Найти индекс минимального элемента массива.
    int[] array4 = {4, 2, -1, 7};


    // 5. Найти индекс максимального элемента массива.
    int[] array5 = {4, 2, -1, 7};

    // 6. Посчитать количество положительных элементов.
    int[] array6 = {4, -2, 0, 7};

    // 7. Посчитать количество отрицательных элементов.
    int[] array7 = {4, -2, 0, -7};


    // 8. Посчитать количество четных элементов.
    int[] array8 = {4, -2, 0, 7};


    //    // 9. Посчитать количество нечетных элементов.
    int[] array9 = {4, -2, 0, 7};


    // 10. Проверить, есть ли в массиве заданное число.
    int[] array10 = {4, -2, 0, 7};


    //   11. Найти среднее арифметическое элементов массива.
    int[] array11 = {1, 2, 3, 4};


    // 12. Вывести все элементы массива, которые больше среднего значения.
    int[] array12 = {1, 2, 3, 4};


    // 13. Проверить, упорядочен ли массив по возрастанию.
    int[] array13 = {1, 2, 3, 4};


    //    // 14. Найти второй по величине элемент массива.
    int[] array14 = {1, -2, 3, -4};

    // 15. Переставить элементы массива в обратном порядке.
    int[] array15 = {1, 2, 3, 4};





}
