package taskHome;

import java.util.Arrays;


public class Task {
    public static void main(String[] args) {
//       // 16. Найти все пары элементов, сумма которых равна заданному числу.
//        int[] array = {1, 2, 3, 4, 5};
//        int target = 6;


//        // 17. Проверить, есть ли в массиве дубликаты.
//        int[] array = {1, 2, 3, 4, 2};
//        boolean hasDuplicates = false;


//        // 18. Удалить все нули из массива и сдвинуть элементы влево.
//        int[] array = {0, 1, 0, 3, 0};
//        int count = 0;



//        // 20. Найти количество чисел, делящихся на заданное число без остатка.
//        int[] array = {10, 15, 20, 24, 30};
//        int divisor = 5;


//        // 21. Упорядочить массив по возрастанию.
//        int[] array = {4, 2, -2, 7, 1, 3, -7};

//        // 22. Найти индекс первого отрицательного элемента.
//        int[] array = {1, 2, -3, 4, -5};
//        int index = 0;



//        // 23. Подсчитать сумму чисел на четных индексах.
//        int[] array = {1, 2, 3, 4, 5};



//        // 24. Найти произведение всех элементов массива.
//        int[] array = {2, 2, 3, 4};



//        // 25. Переместить все отрицательные числа в конец массива.
//        int[] array = {1, -2, 3, -4, 5};



//        // 26. Найти количество уникальных элементов в массиве.
//        int[] array = {1, 2, 2, 3, 4, 4, 5};



//        // 27. Переставить минимальный элемент массива в начало.
//        int[] array = {4, 2, 1, 3, 5};




 // 28. Найти длину самой длинной последовательности одинаковых элементов.
//        int[] array = {1, 1, 2, 2, 2, 2, 3, 3};
//        int maxLength = 1;
//        int currentLength = 1;




//        // 29. Найти сумму положительных элементов, расположенных после первого отрицательного.
//        int[] array = {1, -2, 3, 4, -5};


        // 30. Удалить все дубликаты из массива.
//        int[] array = {1, 2, 2, 3, 4, 4, 5};



    }
}